{
  "backend/main.mo": "Motoko canister that stores per-user best scores, accepts score submissions, and returns a sorted list of top scores.",
  "feature_evidence.json": "Feature evidence report mapping implemented features to their files, components, and test IDs.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries for various frontend game and UI files.",
  "frontend/index.css": "Defines Tailwind base layers and a custom OKLCH color theme for light and dark modes.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Renders the GameShell and a footer linking to caffeine.ai.",
  "frontend/src/components/game/GameCanvas.tsx": "Canvas component running the game loop, handling input, rendering, and restart logic.",
  "frontend/src/components/game/GameOverScreen.tsx": "Game over overlay showing score, wave count, score submission, and leaderboard.",
  "frontend/src/components/game/GameShell.tsx": "Top-level controller managing game phases and composing canvas and UI layers.",
  "frontend/src/components/game/Hud.tsx": "HUD displaying score, wave, and player health hearts.",
  "frontend/src/components/game/PauseOverlay.tsx": "Pause screen overlay with resume and restart options.",
  "frontend/src/components/game/StartScreen.tsx": "Displays the game's start screen with controls overview and a button that triggers onStart.",
  "frontend/src/components/leaderboard/LeaderboardPanel.tsx": "Fetches and displays the top 10 scores with loading, error, and empty states in a table.",
  "frontend/src/components/leaderboard/SubmitScoreCTA.tsx": "Handles user login and score submission, showing appropriate UI for signing in, submitting, or success.",
  "frontend/src/game/assets.ts": "Loads and caches image assets for the game, providing async loading and access to cached results.",
  "frontend/src/game/input.ts": "Manages keyboard and mouse input, updating state and handling pause/restart shortcuts.",
  "frontend/src/game/logic.ts": "Runs core game updates including player movement, enemy spawning, shooting, collisions, and game state progression.",
  "frontend/src/game/renderer.ts": "Renders the game state onto a canvas, drawing background, player, enemies, and bullets using loaded assets.",
  "frontend/src/game/types.ts": "Defines game entity types, constants, difficulty settings, and math helpers for movement and distance.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, refreshing dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements a React context and provider for managing Internet Identity authentication, including login, logout, and identity loading. Wraps AuthClient setup with customizable options.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks to fetch top scores and submit new scores through an actor interface. Handles cache invalidation after score submission.",
  "frontend/src/index.css": "Defines Tailwind base styles and extensive CSS variables for theming in both light and dark modes. Applies global background, text, and border styles.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClientProvider and InternetIdentityProvider. Loads global styles and renders the root component.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, animations, and container settings. Loads plugins and binds styles to CSS variable–driven theme.",
  "project_state.json": "Describes the project’s state, goals, required assets, and existing feature implementations for a browser-based shooting game with leaderboard support."
}